Makerfabs/Makerfabs-ESP32-UWB/Dw3000/src/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register SYS_ENABLE_HI
**/
#define SYS_ENABLE_HI_ID                     0x40                 
#define SYS_ENABLE_HI_LEN                    (4U)                
#define SYS_ENABLE_HI_MASK                   0xFFFFFFFFUL        
#define SYS_ENABLE_HI_CCA_FAIL_ENABLE_BIT_OFFSET (12U)               
#define SYS_ENABLE_HI_CCA_FAIL_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_HI_CCA_FAIL_ENABLE_BIT_MASK 0x1000U              
#define SYS_ENABLE_HI_SPIERR_ENABLE_BIT_OFFSET (11U)               
#define SYS_ENABLE_HI_SPIERR_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_HI_SPIERR_ENABLE_BIT_MASK    0x800U               
#define SYS_ENABLE_HI_SPI_UNF_ENABLE_BIT_OFFSET (10U)               
#define SYS_ENABLE_HI_SPI_UNF_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_HI_SPI_UNF_ENABLE_BIT_MASK    0x400U               
#define SYS_ENABLE_HI_SPI_OVF_ENABLE_BIT_OFFSET (9U)                
#define SYS_ENABLE_HI_SPI_OVF_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_HI_SPI_OVF_ENABLE_BIT_MASK    0x200U               
#define SYS_ENABLE_HI_CMD_ERR_ENABLE_BIT_OFFSET (8U)                
#define SYS_ENABLE_HI_CMD_ERR_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_HI_CMD_ERR_ENABLE_BIT_MASK 0x100U               
#define SYS_ENABLE_HI_AES_ERR_ENABLE_BIT_OFFSET (7U)                
#define SYS_ENABLE_HI_AES_ERR_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_HI_AES_ERR_ENABLE_BIT_MASK 0x80U                
#define SYS_ENABLE_HI_AES_DONE_ENABLE_BIT_OFFSET (6U)                
#define SYS_ENABLE_HI_AES_DONE_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_HI_AES_DONE_ENABLE_BIT_MASK 0x40U                
#define SYS_ENABLE_HI_GPIOIRQ_ENABLE_BIT_OFFSET (5U)                
#define SYS_ENABLE_HI_GPIOIRQ_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_HI_GPIOIRQ_ENABLE_BIT_MASK   0x20U                
#define SYS_ENABLE_HI_VT_DET_ENABLE_BIT_OFFSET (4U)                
#define SYS_ENABLE_HI_VT_DET_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_HI_VT_DET_ENABLE_BIT_MASK 0x10U                
#define SYS_ENABLE_HI_RXPREJ_ENABLE_BIT_OFFSET (1U)                
#define SYS_ENABLE_HI_RXPREJ_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_HI_RXPREJ_ENABLE_BIT_MASK 0x2U                 
                 

/******************************************************************************
* @brief Bit definitions for register SYS_STATUS
**/
#define SYS_STATUS_ID                        0x44                 
#define SYS_STATUS_LEN                       (4U)                
#define SYS_STATUS_MASK                      0xFFFFFFFFUL        
#define SYS_STATUS_ARFE_BIT_OFFSET           (29U)               
#define SYS_STATUS_ARFE_BIT_LEN              (1U)                
#define SYS_STATUS_ARFE_BIT_MASK             0x20000000UL         
#define SYS_STATUS_CPERR_BIT_OFFSET          (28U)               
#define SYS_STATUS_CPERR_BIT_LEN             (1U)                
#define SYS_STATUS_CPERR_BIT_MASK            0x10000000UL         
#define SYS_STATUS_HPDWARN_BIT_OFFSET        (27U)               
#define SYS_STATUS_HPDWARN_BIT_LEN           (1U)                
#define SYS_STATUS_HPDWARN_BIT_MASK          0x8000000UL          
#define SYS_STATUS_RXSTO_BIT_OFFSET          (26U)               
#define SYS_STATUS_RXSTO_BIT_LEN             (1U)                
#define SYS_STATUS_RXSTO_BIT_MASK            0x4000000UL          
#define SYS_STATUS_PLL_HILO_BIT_OFFSET       (25U)               
#define SYS_STATUS_PLL_HILO_BIT_LEN          (1U)                
#define SYS_STATUS_PLL_HILO_BIT_MASK         0x2000000UL          
#define SYS_STATUS_RCINIT_BIT_OFFSET         (24U)               
#define SYS_STATUS_RCINIT_BIT_LEN            (1U)                
#define SYS_STATUS_RCINIT_BIT_MASK           0x1000000UL          
#define SYS_STATUS_SPIRDY_BIT_OFFSET         (23U)               
#define SYS_STATUS_SPIRDY_BIT_LEN            (1U)                
#define SYS_STATUS_SPIRDY_BIT_MASK           0x800000UL                    
#define SYS_STATUS_RXPTO_BIT_OFFSET          (21U)               
#define SYS_STATUS_RXPTO_BIT_LEN             (1U)                
#define SYS_STATUS_RXPTO_BIT_MASK            0x200000UL           
#define SYS_STATUS_RXOVRR_BIT_OFFSET         (20U)               
#define SYS_STATUS_RXOVRR_BIT_LEN            (1U)                
#define SYS_STATUS_RXOVRR_BIT_MASK           0x100000UL           
#define SYS_STATUS_VWARN_BIT_OFFSET          (19U)               
#define SYS_STATUS_VWARN_BIT_LEN             (1U)                
#define SYS_STATUS_VWARN_BIT_MASK            0x80000UL            
#define SYS_STATUS_CIAERR_BIT_OFFSET         (18U)               
#define SYS_STATUS_CIAERR_BIT_LEN            (1U)                
#define SYS_STATUS_CIAERR_BIT_MASK           0x40000UL            
#define SYS_STATUS_RXFTO_BIT_OFFSET          (17U)               
#define SYS_STATUS_RXFTO_BIT_LEN             (1U)                
#define SYS_STATUS_RXFTO_BIT_MASK            0x20000UL            
#define SYS_STATUS_RXFSL_BIT_OFFSET          (16U)               
#define SYS_STATUS_RXFSL_BIT_LEN             (1U)                
#define SYS_STATUS_RXFSL_BIT_MASK            0x10000UL            
#define SYS_STATUS_RXFCE_BIT_OFFSET          (15U)               
#define SYS_STATUS_RXFCE_BIT_LEN             (1U)                
#define SYS_STATUS_RXFCE_BIT_MASK            0x8000U              
#define SYS_STATUS_RXFCG_BIT_OFFSET          (14U)               
#define SYS_STATUS_RXFCG_BIT_LEN             (1U)                
#define SYS_STATUS_RXFCG_BIT_MASK            0x4000U              
#define SYS_STATUS_RXFR_BIT_OFFSET           (13U)               
#define SYS_STATUS_RXFR_BIT_LEN              (1U)                
#define SYS_STATUS_RXFR_BIT_MASK             0x2000U              
#define SYS_STATUS_RXPHE_BIT_OFFSET          (12U)               
#define SYS_STATUS_RXPHE_BIT_LEN             (1U)                
#define SYS_STATUS_RXPHE_BIT_MASK            0x1000U              
#define SYS_STATUS_RXPHD_BIT_OFFSET          (11U)               
#define SYS_STATUS_RXPHD_BIT_LEN             (1U)                
#define SYS_STATUS_RXPHD_BIT_MASK            0x800U               
#define SYS_STATUS_CIADONE_BIT_OFFSET       (10U)               
#define SYS_STATUS_CIADONE_BIT_LEN          (1U)                
#define SYS_STATUS_CIADONE_BIT_MASK         0x400U               
#define SYS_STATUS_RXSFDD_BIT_OFFSET         (9U)                
#define SYS_STATUS_RXSFDD_BIT_LEN            (1U)                
#define SYS_STATUS_RXSFDD_BIT_MASK           0x200U               
#define SYS_STATUS_RXPRD_BIT_OFFSET          (8U)                
#define SYS_STATUS_RXPRD_BIT_LEN             (1U)                
#define SYS_STATUS_RXPRD_BIT_MASK            0x100U               
#define SYS_STATUS_TXFRS_BIT_OFFSET          (7U)                
#define SYS_STATUS_TXFRS_BIT_LEN             (1U)                
#define SYS_STATUS_TXFRS_BIT_MASK            0x80U                
#define SYS_STATUS_TXPHS_BIT_OFFSET          (6U)                
#define SYS_STATUS_TXPHS_BIT_LEN             (1U)                
#define SYS_STATUS_TXPHS_BIT_MASK            0x40U                
#define SYS_STATUS_TXPRS_BIT_OFFSET          (5U)                
#define SYS_STATUS_TXPRS_BIT_LEN             (1U)                
#define SYS_STATUS_TXPRS_BIT_MASK            0x20U                
#define SYS_STATUS_TXFRB_BIT_OFFSET          (4U)                
#define SYS_STATUS_TXFRB_BIT_LEN             (1U)                
#define SYS_STATUS_TXFRB_BIT_MASK            0x10U                
#define SYS_STATUS_AAT_BIT_OFFSET            (3U)                
#define SYS_STATUS_AAT_BIT_LEN               (1U)                
#define SYS_STATUS_AAT_BIT_MASK              0x8U                 
#define SYS_STATUS_SPICRCE_BIT_OFFSET      (2U)                
#define SYS_STATUS_SPICRCE_BIT_LEN         (1U)                
#define SYS_STATUS_SPICRCE_BIT_MASK        0x4U                 
#define SYS_STATUS_CP_LOCK_BIT_OFFSET   (1U)                
#define SYS_STATUS_CP_LOCK_BIT_LEN      (1U)                
#define SYS_STATUS_CP_LOCK_BIT_MASK     0x2U                 
#define SYS_STATUS_IRQS_BIT_OFFSET           (0U)                
#define SYS_STATUS_IRQS_BIT_LEN              (1U)                
#define SYS_STATUS_IRQS_BIT_MASK             0x1U                 

