Makerfabs/Makerfabs-ESP32-UWB/Dw3000/src/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register GPIO_DIR
**/
#define GPIO_DIR_ID                          0x50008              
#define GPIO_DIR_LEN                         (4U)                
#define GPIO_DIR_MASK                        0xFFFFFFFFUL        
#define GPIO_DIR_GDP8_BIT_OFFSET        (8U)                
#define GPIO_DIR_GDP8_BIT_LEN           (1U)                
#define GPIO_DIR_GDP8_BIT_MASK          0x100U               
#define GPIO_DIR_GDP7_BIT_OFFSET        (7U)                
#define GPIO_DIR_GDP7_BIT_LEN           (1U)                
#define GPIO_DIR_GDP7_BIT_MASK          0x80U                
#define GPIO_DIR_GDP6_BIT_OFFSET        (6U)                
#define GPIO_DIR_GDP6_BIT_LEN           (1U)                
#define GPIO_DIR_GDP6_BIT_MASK          0x40U                
#define GPIO_DIR_GDP5_BIT_OFFSET        (5U)                
#define GPIO_DIR_GDP5_BIT_LEN           (1U)                
#define GPIO_DIR_GDP5_BIT_MASK          0x20U                
#define GPIO_DIR_GDP4_BIT_OFFSET        (4U)                
#define GPIO_DIR_GDP4_BIT_LEN           (1U)                
#define GPIO_DIR_GDP4_BIT_MASK          0x10U                
#define GPIO_DIR_GDP3_BIT_OFFSET        (3U)                
#define GPIO_DIR_GDP3_BIT_LEN           (1U)                
#define GPIO_DIR_GDP3_BIT_MASK          0x8U                 
#define GPIO_DIR_GDP2_BIT_OFFSET        (2U)                
#define GPIO_DIR_GDP2_BIT_LEN           (1U)                
#define GPIO_DIR_GDP2_BIT_MASK          0x4U                 
#define GPIO_DIR_GDP1_BIT_OFFSET        (1U)                
#define GPIO_DIR_GDP1_BIT_LEN           (1U)                
#define GPIO_DIR_GDP1_BIT_MASK          0x2U                 
#define GPIO_DIR_GDP0_BIT_OFFSET        (0U)                
#define GPIO_DIR_GDP0_BIT_LEN           (1U)                
#define GPIO_DIR_GDP0_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_OUT
**/
#define GPIO_OUT_ID                          0x5000c              
#define GPIO_OUT_LEN                         (4U)                
#define GPIO_OUT_MASK                        0xFFFFFFFFUL        
#define GPIO_OUT_GOP8_BIT_OFFSET        (8U)                
#define GPIO_OUT_GOP8_BIT_LEN           (1U)                
#define GPIO_OUT_GOP8_BIT_MASK          0x100U               
#define GPIO_OUT_GOP7_BIT_OFFSET        (7U)                
#define GPIO_OUT_GOP7_BIT_LEN           (1U)                
#define GPIO_OUT_GOP7_BIT_MASK          0x80U                
#define GPIO_OUT_GOP6_BIT_OFFSET        (6U)                
#define GPIO_OUT_GOP6_BIT_LEN           (1U)                
#define GPIO_OUT_GOP6_BIT_MASK          0x40U                
#define GPIO_OUT_GOP5_BIT_OFFSET        (5U)                
#define GPIO_OUT_GOP5_BIT_LEN           (1U)                
#define GPIO_OUT_GOP5_BIT_MASK          0x20U                
#define GPIO_OUT_GOP4_BIT_OFFSET        (4U)                
#define GPIO_OUT_GOP4_BIT_LEN           (1U)                
#define GPIO_OUT_GOP4_BIT_MASK          0x10U                
#define GPIO_OUT_GOP3_BIT_OFFSET        (3U)                
#define GPIO_OUT_GOP3_BIT_LEN           (1U)                
#define GPIO_OUT_GOP3_BIT_MASK          0x8U                 
#define GPIO_OUT_GOP2_BIT_OFFSET        (2U)                
#define GPIO_OUT_GOP2_BIT_LEN           (1U)                
#define GPIO_OUT_GOP2_BIT_MASK          0x4U                 
#define GPIO_OUT_GOP1_BIT_OFFSET        (1U)                
#define GPIO_OUT_GOP1_BIT_LEN           (1U)                
#define GPIO_OUT_GOP1_BIT_MASK          0x2U                 
#define GPIO_OUT_GOP0_BIT_OFFSET        (0U)                
#define GPIO_OUT_GOP0_BIT_LEN           (1U)                
#define GPIO_OUT_GOP0_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_IRQE
**/
#define GPIO_IRQE_ID                       0x50010              
#define GPIO_IRQE_LEN                      (4U)                
#define GPIO_IRQE_MASK                     0xFFFFFFFFUL        
#define GPIO_IRQE_GIRQE8_BIT_OFFSET  (8U)                
#define GPIO_IRQE_GIRQE8_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE8_BIT_MASK    0x100U               
#define GPIO_IRQE_GIRQE7_BIT_OFFSET  (7U)                
#define GPIO_IRQE_GIRQE7_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE7_BIT_MASK    0x80U                
#define GPIO_IRQE_GIRQE6_BIT_OFFSET  (6U)                
#define GPIO_IRQE_GIRQE6_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE6_BIT_MASK    0x40U                
#define GPIO_IRQE_GIRQE5_BIT_OFFSET  (5U)                
#define GPIO_IRQE_GIRQE5_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE5_BIT_MASK    0x20U                
#define GPIO_IRQE_GIRQE4_BIT_OFFSET  (4U)                
#define GPIO_IRQE_GIRQE4_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE4_BIT_MASK    0x10U                
#define GPIO_IRQE_GIRQE3_BIT_OFFSET  (3U)                
#define GPIO_IRQE_GIRQE3_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE3_BIT_MASK    0x8U                 
#define GPIO_IRQE_GIRQE2_BIT_OFFSET  (2U)                
#define GPIO_IRQE_GIRQE2_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE2_BIT_MASK    0x4U                 
#define GPIO_IRQE_GIRQE1_BIT_OFFSET  (1U)                
#define GPIO_IRQE_GIRQE1_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE1_BIT_MASK    0x2U                 
#define GPIO_IRQE_GIRQE0_BIT_OFFSET  (0U)                
#define GPIO_IRQE_GIRQE0_BIT_LEN     (1U)                
#define GPIO_IRQE_GIRQE0_BIT_MASK    0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_ISTS
**/
#define GPIO_ISTS_ID                   0x50014              
#define GPIO_ISTS_LEN                  (4U)                
#define GPIO_ISTS_MASK                 0xFFFFFFFFUL        
#define GPIO_ISTS_GISTS8_BIT_OFFSET (8U)                
#define GPIO_ISTS_GISTS8_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS8_BIT_MASK 0x100U               
#define GPIO_ISTS_GISTS7_BIT_OFFSET (7U)                
#define GPIO_ISTS_GISTS7_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS7_BIT_MASK 0x80U                
#define GPIO_ISTS_GISTS6_BIT_OFFSET (6U)                
#define GPIO_ISTS_GISTS6_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS6_BIT_MASK 0x40U                
#define GPIO_ISTS_GISTS5_BIT_OFFSET (5U)                
#define GPIO_ISTS_GISTS5_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS5_BIT_MASK 0x20U                
#define GPIO_ISTS_GISTS4_BIT_OFFSET (4U)                
#define GPIO_ISTS_GISTS4_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS4_BIT_MASK 0x10U                
#define GPIO_ISTS_GISTS3_BIT_OFFSET (3U)                
#define GPIO_ISTS_GISTS3_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS3_BIT_MASK 0x8U                 
#define GPIO_ISTS_GISTS2_BIT_OFFSET (2U)                
#define GPIO_ISTS_GISTS2_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS2_BIT_MASK 0x4U                 
#define GPIO_ISTS_GISTS1_BIT_OFFSET (1U)                
#define GPIO_ISTS_GISTS1_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS1_BIT_MASK 0x2U                 
#define GPIO_ISTS_GISTS0_BIT_OFFSET (0U)                
#define GPIO_ISTS_GISTS0_BIT_LEN (1U)                
#define GPIO_ISTS_GISTS0_BIT_MASK 0x1U                 

