Makerfabs/Makerfabs-ESP32-UWB/Dw3000/src/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register GPIO_IDBE
**/
#define GPIO_IDBE_ID                      0x50028              
#define GPIO_IDBE_LEN                     (4U)                
#define GPIO_IDBE_EN_MASK                    0xFFFFFFFFUL        
#define GPIO_IDBE_GIDBE8_BIT_OFFSET (8U)                
#define GPIO_IDBE_GIDBE8_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE8_BIT_MASK  0x100U               
#define GPIO_IDBE_GIDBE7_BIT_OFFSET (7U)                
#define GPIO_IDBE_GIDBE7_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE7_BIT_MASK  0x80U                
#define GPIO_IDBE_GIDBE6_BIT_OFFSET (6U)                
#define GPIO_IDBE_GIDBE6_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE6_BIT_MASK  0x40U                
#define GPIO_IDBE_GIDBE5_BIT_OFFSET (5U)                
#define GPIO_IDBE_GIDBE5_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE5_BIT_MASK  0x20U                
#define GPIO_IDBE_GIDBE4_BIT_OFFSET (4U)                
#define GPIO_IDBE_GIDBE4_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE4_BIT_MASK  0x10U                
#define GPIO_IDBE_GIDBE3_BIT_OFFSET (3U)                
#define GPIO_IDBE_GIDBE3_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE3_BIT_MASK  0x8U                 
#define GPIO_IDBE_GIDBE2_BIT_OFFSET (2U)                
#define GPIO_IDBE_GIDBE2_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE2_BIT_MASK  0x4U                 
#define GPIO_IDBE_GIDBE1_BIT_OFFSET (1U)                
#define GPIO_IDBE_GIDBE1_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE1_BIT_MASK  0x2U                 
#define GPIO_IDBE_GIDBE0_BIT_OFFSET (0U)                
#define GPIO_IDBE_GIDBE0_BIT_LEN   (1U)                
#define GPIO_IDBE_GIDBE0_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_RAW
**/
#define GPIO_RAW_ID                     0x5002c              
#define GPIO_RAW_LEN                    (4U)                
#define GPIO_RAW_MASK                   0xFFFFFFFFUL        
#define GPIO_RAW_GRAWP8_BIT_OFFSET (8U)                
#define GPIO_RAW_GRAWP8_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP8_BIT_MASK 0x100U               
#define GPIO_RAW_GRAWP7_BIT_OFFSET (7U)                
#define GPIO_RAW_GRAWP7_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP7_BIT_MASK 0x80U                
#define GPIO_RAW_GRAWP6_BIT_OFFSET (6U)                
#define GPIO_RAW_GRAWP6_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP6_BIT_MASK 0x40U                
#define GPIO_RAW_GRAWP5_BIT_OFFSET (5U)                
#define GPIO_RAW_GRAWP5_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP5_BIT_MASK 0x20U                
#define GPIO_RAW_GRAWP4_BIT_OFFSET (4U)                
#define GPIO_RAW_GRAWP4_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP4_BIT_MASK 0x10U                
#define GPIO_RAW_GRAWP3_BIT_OFFSET (3U)                
#define GPIO_RAW_GRAWP3_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP3_BIT_MASK 0x8U                 
#define GPIO_RAW_GRAWP2_BIT_OFFSET (2U)                
#define GPIO_RAW_GRAWP2_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP2_BIT_MASK 0x4U                 
#define GPIO_RAW_GRAWP1_BIT_OFFSET (1U)                
#define GPIO_RAW_GRAWP1_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP1_BIT_MASK 0x2U                 
#define GPIO_RAW_GRAWP0_BIT_OFFSET (0U)                
#define GPIO_RAW_GRAWP0_BIT_LEN  (1U)                
#define GPIO_RAW_GRAWP0_BIT_MASK 0x1U                 

/******************************************************************************
* @brief Bit definitions for register DTUNE0
**/
#define DTUNE0_ID                            0x60000              
#define DTUNE0_LEN                           (4U)                
#define DTUNE0_MASK                          0xFFFFFFFFUL        
#define DTUNE0_RX_SFD_TOC_BIT_OFFSET         (16U)               
#define DTUNE0_RX_SFD_TOC_BIT_LEN            (16U)               
#define DTUNE0_RX_SFD_TOC_BIT_MASK           0xffff0000UL         
#define DTUNE0_PRE_PAC_SYM_BIT_OFFSET        (0U)                
#define DTUNE0_PRE_PAC_SYM_BIT_LEN           (2U)                
#define DTUNE0_PRE_PAC_SYM_BIT_MASK          0x3U                 

/******************************************************************************
* @brief Bit definitions for register DTUNE1
**/
#define DTUNE1_ID                            0x60004              
#define DTUNE1_LEN                           (4U)                
#define DTUNE1_MASK                          0xFFFFFFFFUL        
#define DTUNE1_PRE_TOC_BIT_OFFSET            (0U)                
#define DTUNE1_PRE_TOC_BIT_LEN               (16U)               
#define DTUNE1_PRE_TOC_BIT_MASK              0xffffU              


/******************************************************************************
* @brief Bit definitions for register DTUNE3
**/
#define DTUNE3_ID                            0x6000c              
#define DTUNE3_LEN                           (4U)                
#define DTUNE3_MASK                          0xFFFFFFFFUL        








/******************************************************************************
* @brief Bit definitions for register DRX_DIAG3
**/
#define DRX_DIAG3_ID                         0x60029              /*  */
#define DRX_DIAG3_LEN                        (4U)                
#define DRX_DIAG3_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG3_CAR_INT_BIT_OFFSET         (0U)                
#define DRX_DIAG3_CAR_INT_BIT_LEN            (21U)               
#define DRX_DIAG3_CAR_INT_BIT_MASK           0x1fffffUL           





/******************************************************************************
* @brief Bit definitions for register RF_ENABLE
**/
#define RF_ENABLE_ID                            0x70000              
#define RF_ENABLE_LEN                           (4U)                
#define RF_ENABLE_MASK                          0xFFFFFFFFUL        
#define RF_ENABLE_TX_SW_EN_BIT_OFFSET           (25U)               
#define RF_ENABLE_TX_SW_EN_BIT_LEN              (1U)                
#define RF_ENABLE_TX_SW_EN_BIT_MASK             0x2000000UL          
#define RF_ENABLE_TX_CH5_BIT_OFFSET             (13U)               
#define RF_ENABLE_TX_CH5_BIT_LEN                (1U)                
#define RF_ENABLE_TX_CH5_BIT_MASK               0x2000U              
#define RF_ENABLE_TX_EN_BIT_OFFSET              (12U)               
#define RF_ENABLE_TX_EN_BIT_LEN                 (1U)                
#define RF_ENABLE_TX_EN_BIT_MASK                0x1000U              
#define RF_ENABLE_TX_EN_BUF_BIT_OFFSET          (11U)               
#define RF_ENABLE_TX_EN_BUF_BIT_LEN             (1U)                
#define RF_ENABLE_TX_EN_BUF_BIT_MASK            0x800U               
#define RF_ENABLE_TX_BIAS_EN_BIT_OFFSET         (10U)               
#define RF_ENABLE_TX_BIAS_EN_BIT_LEN            (1U)                
#define RF_ENABLE_TX_BIAS_EN_BIT_MASK           0x400U               

