Makerfabs/Makerfabs-ESP32-UWB/Dw3000/src/dw3000_regs.h
/******************************************************************************
* @brief Bit definitions for register IP_CONFIG_LO
**/
#define IP_CONFIG_LO_ID                      0xe000c              
#define IP_CONFIG_LO_LEN                     (2U)                
#define IP_CONFIG_LO_MASK                    0xFFFFU                            
#define IP_CONFIG_LO_IP_PMULT_BIT_OFFSET (5U)                
#define IP_CONFIG_LO_IP_PMULT_BIT_LEN  (2U)                
#define IP_CONFIG_LO_IP_PMULT_BIT_MASK 0x60U                
#define IP_CONFIG_LO_IP_NTM_BIT_OFFSET (0U)                
#define IP_CONFIG_LO_IP_NTM_BIT_LEN (5U)                
#define IP_CONFIG_LO_IP_NTM_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register IP_CONFIG_HI
**/
#define IP_CONFIG_HI_ID                      0xe000e              /*  { aliased = true}  */
#define IP_CONFIG_HI_LEN                     (4U)
#define IP_CONFIG_HI_MASK                    0xFFFFFFFFUL
#define IP_CONFIG_HI_IP_RTM_BIT_OFFSET (0U)
#define IP_CONFIG_HI_IP_RTM_BIT_LEN (5U)
#define IP_CONFIG_HI_IP_RTM_BIT_MASK 0x1fU

/******************************************************************************
* @brief Bit definitions for register STS_CONFIG_LO
**/
#define STS_CONFIG_LO_ID                      0xe0012              /*  { aliased = true}  */
#define STS_CONFIG_LO_LEN                     (4U)
#define STS_CONFIG_LO_MASK                    0xFFFFFFFFUL
#define STS_CONFIG_LO_STS_MAN_TH_BIT_OFFSET (16U)
#define STS_CONFIG_LO_STS_MAN_TH_BIT_LEN (7U)
#define STS_CONFIG_LO_STS_MAN_TH_BIT_MASK 0x7f0000UL
#define STS_CONFIG_LO_STS_PMULT_BIT_OFFSET (5U)
#define STS_CONFIG_LO_STS_PMULT_BIT_LEN  (2U)
#define STS_CONFIG_LO_STS_PMULT_BIT_MASK 0x60U
#define STS_CONFIG_LO_STS_NTM_BIT_OFFSET (0U)
#define STS_CONFIG_LO_STS_NTM_BIT_LEN (5U)
#define STS_CONFIG_LO_STS_NTM_BIT_MASK 0x1fU

/******************************************************************************
* @brief Bit definitions for register STS_CONFIG_HI
**/
#define STS_CONFIG_HI_ID                      0xe0016              /*  { aliased = true}  */
#define STS_CONFIG_HI_LEN                     (4U)
#define STS_CONFIG_HI_MASK                    0xFFFFFFFFUL
#define STS_CONFIG_HI_STS_PGR_EN_BIT_OFFSET (31U)
#define STS_CONFIG_HI_STS_PGR_EN_BIT_LEN  (1U)
#define STS_CONFIG_HI_STS_PGR_EN_BIT_MASK 0x80000000UL
#define STS_CONFIG_HI_STS_SS_EN_BIT_OFFSET (30U)
#define STS_CONFIG_HI_STS_SS_EN_BIT_LEN    (1U)
#define STS_CONFIG_HI_STS_SS_EN_BIT_MASK   0x40000000UL
#define STS_CONFIG_HI_STS_CQ_EN_BIT_OFFSET (29U)
#define STS_CONFIG_HI_STS_CQ_EN_BIT_LEN    (1U)
#define STS_CONFIG_HI_STS_CQ_EN_BIT_MASK   0x20000000UL
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_OFFSET (28U)
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_LEN    (1U)
#define STS_CONFIG_HI_FP_AGREED_EN_BIT_MASK   0x10000000UL

/******************************************************************************
* @brief Bit definitions for register CIA_ADJUST
**/
#define CIA_ADJUST_ID            0xe001a              /* {aliased=true} */
#define CIA_ADJUST_LEN           (4U)
#define CIA_ADJUST_MASK          0xFFFFFFFFUL
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_OFFSET (0U)
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_LEN (14U)
#define CIA_ADJUST_PDOA_ADJ_OFFSET_BIT_MASK 0x3fffU

/******************************************************************************
* @brief Bit definitions for register PGF_DELAY_COMP_LO
**/
#define PGF_DELAY_COMP_LO_ID                 0xe001e              /* {aliased=true} */

/******************************************************************************
* @brief Bit definitions for register PGF_DELAY_COMP_HI
**/
#define PGF_DELAY_COMP_HI_ID                 0xe0022              /* {aliased=true} */

/******************************************************************************
* @brief Bit definitions for register EVENT_CTRL
**/
#define EVC_CTRL_ID                        0xf0000              
#define EVC_CTRL_LEN                       (4U)                
#define EVC_CTRL_MASK                      0xFFFFFFFFUL        
#define EVC_CTRL_EVC_CLR_BIT_OFFSET (1U)                
#define EVC_CTRL_EVC_CLR_BIT_LEN   (1U)                
#define EVC_CTRL_EVC_CLR_BIT_MASK  0x2U                 
#define EVC_CTRL_EVC_EN_BIT_OFFSET (0U)                
#define EVC_CTRL_EVC_EN_BIT_LEN    (1U)                
#define EVC_CTRL_EVC_EN_BIT_MASK   0x1U                 

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT0
**/
#define EVC_COUNT0_ID                      0xf0004              
#define EVC_COUNT0_LEN                     (4U)                
#define EVC_COUNT0_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT0_EVC_RSE_BIT_OFFSET  (16U)               
#define EVC_COUNT0_EVC_RSE_BIT_LEN     (12U)               
#define EVC_COUNT0_EVC_RSE_BIT_MASK    0xfff0000UL          
#define EVC_COUNT0_EVC_PHE_BIT_OFFSET  (0U)                
#define EVC_COUNT0_EVC_PHE_BIT_LEN     (12U)               
#define EVC_COUNT0_EVC_PHE_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT1
**/
#define EVC_COUNT1_ID                      0xf0008              
#define EVC_COUNT1_LEN                     (4U)                
#define EVC_COUNT1_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT1_EVC_FCE_BIT_OFFSET  (16U)               
#define EVC_COUNT1_EVC_FCE_BIT_LEN     (12U)               
#define EVC_COUNT1_EVC_FCE_BIT_MASK    0xfff0000UL          
#define EVC_COUNT1_EVC_FCG_BIT_OFFSET  (0U)                
#define EVC_COUNT1_EVC_FCG_BIT_LEN     (12U)               
#define EVC_COUNT1_EVC_FCG_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT2
**/
#define EVC_COUNT2_ID                      0xf000c              
#define EVC_COUNT2_LEN                     (4U)                
#define EVC_COUNT2_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT2_EVC_OVR_BIT_OFFSET (16U)               
#define EVC_COUNT2_EVC_OVR_BIT_LEN    (8U)                
#define EVC_COUNT2_EVC_OVR_BIT_MASK   0xff0000UL           
#define EVC_COUNT2_EVC_FFR_BIT_OFFSET   (0U)                
#define EVC_COUNT2_EVC_FFR_BIT_LEN      (8U)                
#define EVC_COUNT2_EVC_FFR_BIT_MASK     0xffU                

